exports.getEndTimeOfTheDay = () => {
	return `🛌 <b>تنظیم ساعت خواب</b>

لطفاً ساعت پایان روزت رو وارد کن تا بات بتونه روزهای تو رو درست محاسبه کنه.  
فرمت ورودی باید به صورت زیر باشه:  
⏰ <code>00:30</code>  

(توجه: فقط فرمت ۲۴ ساعته پشتیبانی میشه. مثلاً <code>07:15</code> یا <code>22:45</code>)

<b>پیشفرض</b> : "00:00"
`;
};

exports.incorrectEndTimeFormat = () => {
	return `⚠️ فرمت وارد شده صحیح نیست. لطفاً ساعت پایان روزت رو به صورت درست وارد کن.  
فرمت ورودی باید به صورت زیر باشه:
⏰ <code>00:30</code>`;
};

exports.thanksForInformation = (endTime) => {
	return `✅ ممنونم! ساعت پایان روزت روی <b>${endTime}</b> تنظیم شد.
    
    <b>دکمه "بعدی" رو بزن تا به منوی اصلی بری.</b>`;
};
