exports.mainMenu = () => {
	return `🏠<i><b>منوی اصلی</b></i>

🔽 یکی از <b>گزینه</b> ‌های زیر رو انتخاب کنید:`;
};

exports.guide = () => {
	return `
📖 <b><i>راهنما</i></b>

این ربات برای مدیریت و پیگیری برنامه‌های روزانه‌ت ساخته شده.  
باهاش می‌تونی تسک‌هات رو ثبت کنی، امتیاز بگیری و عملکردت رو بهتر کنی 🚀

<b>🔹 مدیریت برنامه‌ها</b>  
- <b>برنامه امروز</b> : لیست تسک‌های امروزت رو می‌بینی، می‌تونی تسک جدید اضافه کنی یا یکی رو حذف کنی.  
  ⏰ هر تسک با این فرمت ثبت میشه:  
  <code>عنوان تسک + از + ساعت شروع + تا + ساعت پایان</code>  
  ➡️ می‌تونی یک یا چند تسک رو پشت سر هم با همین الگو وارد کنی.  

- <b>روزهای گذشته</b> : تاریخچه‌ی برنامه‌های 28 روز گذشته رو می‌تونی مرور کنی.  
  بعد از انتخاب تاریخ، گزارش اون روز (امتیازها + لیست تسک‌های انجام‌شده، نیمه‌تمام و انجام‌نشده و لغوشده) نمایش داده میشه.   

<b>🔹 سیستم امتیازدهی</b>  
<b>امتیاز مثبت ✅</b>
شما در شرایط زیر امتیاز مثبت دریافت می‌کنید:

1. <b>ثبت برنامه روزانه به موقع</b>
   - وقتی اولین تسک روزانه خود را <b>تا ۸ ساعت بعد از ساعت پایان روز</b> ثبت می‌کنید.
   - امتیاز: <b>10 امتیاز مثبت</b>

2. <b>اعلام حضور در زمان شروع تسک</b>
   - اگر <b>۵ دقیقه اول شروع تسک</b>، وضعیت "شروع فعالیت" را ثبت کنید.
   - امتیاز: <b>2 امتیاز مثبت</b>

3. <b>تکمیل تسک به موقع</b>
   - وقتی تسک را <b>در بازه زمانی تعیین شده پایان دهید</b>.
   - امتیاز: <b>متغیر، متناسب با زمان شروع و پایان تسک </b> (وابسته به طول تسک)

4. <b>نیمه تکمیل کردن تسک</b>
   - اگر تسک را شروع کنید اما کامل انجام ندهید، وضعیت "نیمه تمام" ثبت شود.
   - امتیاز: <b>متغیر، متناسب با زمان شروع و پایان تسک </b>

---

<b>امتیاز منفی ❌</b>
شما در شرایط زیر امتیاز منفی دریافت می‌کنید:

1. <b>ثبت برنامه روزانه دیر</b>
   - اگر اولین تسک روزانه <b>بعد از ۸ ساعت از ساعت پایان روز</b> ثبت شود.
   - امتیاز: <b>10 امتیاز منفی</b>

2. <b>انجام ندادن تسک</b>
   - اگر تسکی را <b>شروع نکرده یا لغو کرده باشید</b> و زمان آن گذشته باشد.
   - امتیاز: <b>متغیر، متناسب با زمان شروع و پایان تسک </b> (وابسته به طول تسک)


---

❗️ توجه: برای راحتی بیشتر، همه‌ی تاریخ‌ها در ربات به صورت <b>تاریخ شمسی</b> نمایش داده میشن.
برای هر سوال یا مشکلی هم می‌تونی با من در ارتباط باشی.  
@poourya`;
};
